init.el

(defvar my-alias-prefix "my/")

(defun make-alias (fun &optional prefix)
  "Create an alias for function `fun' by prepending the value of
  `my-alias-prefix' to the symbol name. Use `prefix' to provide
  an alternative prefix string. Example:

  (defun bar () (message \"I am bar\"))
  (make-alias 'bar \"foo-\")
  (foo-bar) => \"I am bar\""

  (interactive)
  (defalias
    (intern (concat (or prefix my-alias-prefix) (symbol-name fun)))
    fun))

(defun init-edit ()
  "Edit ~/.emacs.d/init.org"
  (interactive)
  (find-file "~/.emacs.d/init.org"))
(make-alias 'init-edit)

(defun init-tangle-and-load ()
  "Tangle ~/.emacs.d/init.org and load the result"
  (interactive)
  (init-edit)
  (org-babel-tangle)
  (load "~/.emacs.d/init.el")
  (switch-to-buffer "*Messages*"))
(make-alias 'init-tangle-and-load)

(unless (= emacs-major-version 24)
  (error "Emacs version 24 is required"))

(message "loading ~/.emacs.d/init.el")

(global-auto-revert-mode 1)

;; (setq debug-on-error t)
;; (setq debug-on-signal t)

(when (>= emacs-major-version 24)
  (require 'package)
  (package-initialize)
  ;; Original Emacs Lisp Package Archive
  (add-to-list 'package-archives
       '("elpa" . "http://tromey.com/elpa/") t)
  ;; User-contributed repository
  ;; Marmalade is for packages that cannot be uploaded to the official ELPA repository.
  (add-to-list 'package-archives
       '("marmalade" . "http://marmalade-repo.org/packages/") t)
  (add-to-list 'package-archives
       '("melpa" . "http://melpa.org/packages/") t)
  (add-to-list 'package-archives
       '("org" . "http://orgmode.org/elpa/") t)
  (add-to-list 'package-archives
       '("elpy" . "http://jorgenschaefer.github.io/packages/") t)
  )
