init.org
** define a list of packages

I could not find an obvious way to define a list of packages to
automatically install, so here are some functions to do so. Execute
=M-x install-packages= to install any missing packages. Note that
when installing org-mode from ELPA for the first time, you must be
sure that the builtin version of org-mode has not been loaded since
emacs was first started.

#+BEGIN_SRC elisp
(defun package-installed-not-builtin-p (package &optional min-version)
  "Return true if PACKAGE, of MIN-VERSION or newer, is installed
(ignoring built-in versions).  MIN-VERSION should be a version list"

  (unless package--initialized (error "package.el is not yet initialized!"))
(if (< emacs-major-version 4)
    ;; < emacs 24.4
    (let ((pkg-desc (assq package package-alist)))
      (if pkg-desc
          (version-list-<= min-version
                           (package-desc-vers (cdr pkg-desc)))))
  ;; >= emacs 24.4
  (let ((pkg-descs (cdr (assq package package-alist))))
    (and pkg-descs
         (version-list-<= min-version
                          (package-desc-version (car pkg-descs)))))
  ))

(defun package-install-list (pkg-list)
  ;; Install each package in pkg-list if necessary.
  (mapcar
   (lambda (pkg)
     (unless (package-installed-not-builtin-p pkg)
       (package-install pkg)))
   pkg-list)
  (message "done installing packages"))

(defvar my-package-list
  '(ace-jump-mode
    ace-jump-buffer
    auctex
    edit-server
    elpy
    ess
    expand-region
    gist
    git-timemachine
    helm
    htmlize
    jinja2-mode
    magit
    markdown-mode
    moinmoin-mode
    org
    ;; projectile
    rainbow-delimiters
    ;; smex
    visual-regexp
    visual-regexp-steroids
    yaml-mode
    yas-jit))

(defun install-packages ()
  ;; Install packages listed in global 'my-package-list'
  (interactive)
  (package-list-packages)
  (package-install-list my-package-list))
(make-alias 'install-packages)
#+END_SRC

* Navigation
** =electric-buffer-list=

Replace default =list-buffers= with =electric-buffer-list= for buffer
selection.

#+BEGIN_SRC elisp
(global-set-key (kbd "C-x C-b") 'electric-buffer-list)
#+END_SRC

** Switch windows with arrow keys

Note that other-window is bound by default to =C-x o=

#+BEGIN_SRC elisp
(defun back-window ()
  (interactive)
  (other-window -1))
(global-set-key (kbd "C-<right>") 'other-window)
(global-set-key (kbd "C-<left>") 'back-window)
#+END_SRC

** helm

Helm is a pretty intense change to the default behavior for executing
commands, switching buffers, finding files, etc. It takes some getting
used to, but woah.

See http://tuhdo.github.io/helm-intro.html for setup suggestions.

Using the configuration below, some hints:

- When in the =helm-M-x= buffer, =TAB= shows documentation for the selected command.
- As suggested, I've replaced the default behavior of =M-y= to use
  helm's equivalent, which shows a menu of recently copied regions
  (rather than cycling through entries of the kill ring after a yank).

#+BEGIN_SRC elisp
(condition-case nil
    (progn
      (require 'helm-config)
      (helm-mode 1)
      (global-set-key (kbd "M-x") 'helm-M-x)
      (global-set-key (kbd "M-y") 'helm-show-kill-ring)
      (global-set-key (kbd "C-c h o") 'helm-occur)
      (global-set-key (kbd "C-h SPC") 'helm-all-mark-rings)
      (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
      (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)
      (define-key helm-map (kbd "C-z")  'helm-select-action)
      )
  (error (message "** could not activate helm")))
#+END_SRC

** smex

(seems to be replaced by helm)

See https://github.com/nonsequitur/smex - Ido extension for previously
used extended commands. Installed using ELPA.

#+BEGIN_SRC elisp
;; (if (package-installed-p 'smex)
;;     (progn
;;       (global-set-key (kbd "M-x") 'smex)
;;       (global-set-key (kbd "C-c M-x") 'smex-major-mode-commands)
;;       ;; This is your old M-x.
;;       (global-set-key (kbd "C-x M-x") 'execute-extended-command)))
#+END_SRC

** projectile

TODO: check out =helm-projectile=

Project-centric file and directory navigation - see
https://github.com/bbatsov/projectile

Installed using ELPA.

Basic key bindings (see the url above for a complete list).

| keybinding | description                                       |
| C-c p C-h  | Help with projectile key bindings                 |
| C-c p f    | Display a list of all files in the project.       |
| C-c p d    | Display a list of all directories in the project. |

#+BEGIN_SRC elisp
;; (if (package-installed-p 'projectile)
;;     (projectile-global-mode))
#+END_SRC

** ido-mode

- http://www.masteringemacs.org/articles/2010/10/10/introduction-to-ido-mode/

#+BEGIN_SRC elisp
;; (setq ido-enable-flex-matching t)
;; (setq ido-everywhere t)
;; (setq ido-use-virtual-buffers t)
;; (ido-mode 1)
#+END_SRC

use recentf with ido - see http://wikemacs.org/wiki/Recentf

#+BEGIN_SRC elisp
;; (recentf-mode 1)
;; (defun ido-choose-from-recentf ()
;;   "Use ido to select a recently visited file from the `recentf-list'"
;;   (interactive)
;;   (find-file (ido-completing-read "Open file: " recentf-list nil t)))
;; (global-set-key (kbd "C-c f") 'ido-choose-from-recentf)
#+END_SRC

** ibuffer

- http://emacs-fu.blogspot.com/2010/02/dealing-with-many-buffers-ibuffer.html

#+BEGIN_SRC elisp
(require 'ibuffer)
(global-set-key (kbd "C-x C-g") 'ibuffer)
(global-set-key (kbd "C-x M-g") 'ibuffer-switch-to-saved-filter-groups)
(setq ibuffer-show-empty-filter-groups nil)
#+END_SRC

Function to load config file. Load on starup.

#+BEGIN_SRC elisp
(defvar my-ibuffer-config-file "~/.emacs.d/ibuffer-config.el")

(defun ibuffer-load-config ()
  ;; load the ibuffer config file
  (interactive)
  (condition-case nil
      (progn
	(message (format "** loading ibuffer config in %s" my-ibuffer-config-file))
	(load my-ibuffer-config-file)
	)
    (error (message (format "** could not load %s" my-ibuffer-config-file))))
  )

(ibuffer-load-config)
#+END_SRC

Show/hide all filter groups

#+BEGIN_SRC elisp
(defun ibuffer-show-all-filter-groups ()
  "Show all filter groups"
  (interactive)
  (setq ibuffer-hidden-filter-groups nil)
  (ibuffer-update nil t))

(defun ibuffer-hide-all-filter-groups ()
  "Hide all filter groups"
  (interactive)
  (setq ibuffer-hidden-filter-groups
	(delete-dups
	 (append ibuffer-hidden-filter-groups
		 (mapcar 'car (ibuffer-generate-filter-groups
			       (ibuffer-current-state-list)
			       (not ibuffer-show-empty-filter-groups)
			       t)))))
  (ibuffer-update nil t))
#+END_SRC

#+BEGIN_SRC elisp
(defun ibuffer-reload ()
  ;; kill ibuffer, reload the config file, and return to ibuffer
  (interactive)
  (ibuffer)
  (kill-buffer)
  (ibuffer-load-config)
  (ibuffer)
  )
#+END_SRC

From http://www.emacswiki.org/emacs/IbufferMode

#+BEGIN_SRC elisp
(defun my-ibuffer-sort-hook ()
  ;; add another sorting method for ibuffer (allow the grouping of
  ;; filenames and dired buffers
  (define-ibuffer-sorter filename-or-dired
    "Sort the buffers by their pathname."
    (:description "filenames plus dired")
    (string-lessp
     (with-current-buffer (car a)
       (or buffer-file-name
	   (if (eq major-mode 'dired-mode)
	       (expand-file-name dired-directory))
	   ;; so that all non pathnames are at the end
	   "~"))
     (with-current-buffer (car b)
       (or buffer-file-name
	   (if (eq major-mode 'dired-mode)
	       (expand-file-name dired-directory))
	   ;; so that all non pathnames are at the end
	   "~"))))
  (define-key ibuffer-mode-map (kbd "s p")     'ibuffer-do-sort-by-filename-or-dired)
  )
#+END_SRC

From http://curiousprogrammer.wordpress.com/2009/04/02/ibuffer/

#+BEGIN_SRC elisp
(defun ibuffer-ediff-marked-buffers ()
  "Compare two marked buffers using ediff"
  (interactive)
  (let* ((marked-buffers (ibuffer-get-marked-buffers))
         (len (length marked-buffers)))
    (unless (= 2 len)
      (error (format "%s buffer%s been marked (needs to be 2)"
                     len (if (= len 1) " has" "s have"))))
    (ediff-buffers (car marked-buffers) (cadr marked-buffers))))
#+END_SRC

Hooks

#+BEGIN_SRC elisp
(add-hook 'ibuffer-mode-hook
          '(lambda ()
             (ibuffer-auto-mode 1) ;; minor mode that keeps the buffer list up to date
             (ibuffer-switch-to-saved-filter-groups "default")
             (define-key ibuffer-mode-map (kbd "a") 'ibuffer-show-all-filter-groups)
             (define-key ibuffer-mode-map (kbd "z") 'ibuffer-hide-all-filter-groups)
             (define-key ibuffer-mode-map (kbd "e") 'ibuffer-ediff-marked-buffers)
             (my-ibuffer-sort-hook)
             ;; don't accidentally print; see http://irreal.org/blog/?p=2013
             (defadvice ibuffer-do-print (before print-buffer-query activate)
               (unless (y-or-n-p "Print buffer? ")
                 (error "Cancelled")))
             )
          )
#+END_SRC

** uniquify

Distinguish buffer names for identically-named files.

- http://www.emacswiki.org/emacs/uniquify
- Note that as of 24.4, uniquify is enabled by default, but with
  =uniquify-buffer-name-style= set to =post-forward-angle-brackets=.

#+BEGIN_SRC elisp
(require 'uniquify)
(setq uniquify-buffer-name-style 'post-forward)
#+END_SRC

* Marking, cursor movement and appearance
