init.org
** org-mode utilities

#+BEGIN_SRC elisp
(defun insert-date ()
  ;; Insert today's timestamp in format "<%Y-%m-%d %a>"
  (interactive)
  (insert (format-time-string "<%Y-%m-%d %a>")))
(make-alias 'insert-date)
#+END_SRC

#+BEGIN_SRC elisp
(defun org-add-entry (filename time-format)
  ;; Add an entry to an org-file with today's timestamp.
  (interactive "FFile: ")
  (find-file filename)
  (end-of-buffer)
  (delete-blank-lines)
  ;;(insert "\n* ")
  (insert (format-time-string time-format))
  (beginning-of-line)
  (forward-char 2))
#+END_SRC

Add a new entry to main notes file.

#+BEGIN_SRC elisp
(defvar my/org-index "~/Dropbox/notes/index.org")

(defun my/org-index-add-entry ()
  (interactive)
  (org-add-entry my/org-index "\n* <%Y-%m-%d %a>"))

(defun my/find-org-index ()
  (interactive)
  (find-file my/org-index))
#+END_SRC

Add a new entry to my journal.

#+BEGIN_SRC elisp
(global-set-key
 (kbd "C-x C-j") (lambda () (interactive)
                   (org-add-entry "~/Dropbox/journal/journal.org"
                                  "\n* %A, %B %d, %Y")))
#+END_SRC

* markdown-mode

Installed using ELPA.

#+BEGIN_SRC elisp
(push '("\\.md" . markdown-mode) auto-mode-alist)
#+END_SRC

* chrome "edit with emacs"

'edit-server' is initialized by ELPA, but we need to start the server.

#+BEGIN_SRC elisp
(condition-case nil
    (edit-server-start)
  (error (message "** could not start edit-server (chrome edit with emacs)")))
#+END_SRC

* Python

- http://jesselegg.com/archives/2010/02/25/emacs-python-programmers-part-1/

** Python hooks

We'll use flake8 for syntax checking, but we want to be able to ignore
certain rules, so use a shell-script wrapper set the value of
=python-check-command= to use it.

#+BEGIN_SRC sh :exports both :results output
cat ~/.emacs.d/bin/pychecker
#+END_SRC

Error codes are listed here: http://pep8.readthedocs.org/en/latest/intro.html#error-codes

#+BEGIN_SRC elisp
(add-hook 'python-mode-hook
          '(lambda ()
             (message "Loading python-mode hooks")
             (setq indent-tabs-mode nil)
             (setq tab-width 4)
             (setq py-indent-offset tab-width)
             (setq py-smart-indentation t)
             (define-key python-mode-map "\C-m" 'newline-and-indent)
             (setq python-check-command "~/.emacs.d/bin/pychecker")
             ))
#+END_SRC

File name mappings

#+BEGIN_SRC elisp
(push '("SConstruct" . python-mode) auto-mode-alist)
(push '("SConscript" . python-mode) auto-mode-alist)
(push '("*.cgi" . python-mode) auto-mode-alist)
#+END_SRC

Default 'untabify converts a tab to equivalent number of spaces before
deleting a single character.

#+BEGIN_SRC elisp
(setq backward-delete-char-untabify-method "all")
#+END_SRC

** elpy

Along with some helper functions (see below) elpy has replaced a
number of python-related packages that I was using before, like
=jedi=, =flymake-cursor=, =flycheck=, and =python-pylint=.

- Installation :: https://github.com/jorgenschaefer/elpy/wiki/Installation
- note that =python-check-command= (set in python hooks above) defines the program used by =elpy-check=

#+BEGIN_SRC elisp
(condition-case nil
    (elpy-enable) ;; install from ELPA
  (error (message "** could not enable elpy")))
#+END_SRC

As of version 1.5.0, the elpy python package is distributed with the
ELPA elisp package, but other dependencies (such as jedi) still need
to be available. Assuming elpy dependencies are installed in
~/.emacs.d/emacs-env

#+BEGIN_SRC elisp
(defvar venv-default "~/.emacs.d/emacs-env")
(defun activate-venv-default ()
  (interactive)
  (pyvenv-activate venv-default)
  (elpy-rpc-restart))
(make-alias 'activate-venv-default)
#+END_SRC

Also add executables in the default virtualenv to =$PATH=

#+BEGIN_SRC elisp
(prepend-path "~/.emacs.d/emacs-env/bin")
#+END_SRC

Here's a function that tries to activate a virtualenv in the current
project.

#+BEGIN_SRC elisp
(defun activate-venv ()
  "Activate a virtualenv if one can be found in the current
project; otherwise activate the virtualenv defined in
`venv-default'. Also restarts the elpy rpc process."
  (interactive)
  (let ((venv nil)
        (find-pattern "find %s -path '*bin/activate' -maxdepth 4")
        (msg ""))

    (if (elpy-project-root)
        (setq venv
              (replace-regexp-in-string
               "/bin/activate[ \t\n]*" ""
               (shell-command-to-string
                (format find-pattern (elpy-project-root))))))

    (if (< (length venv) 1)
        (progn
          (setq venv venv-default)
          (setq msg "(cound not find a virtualenv here) ")))

    (if (y-or-n-p (format "%sActivate %s?" msg venv))
        (progn
          (pyvenv-activate venv)
          (elpy-rpc-restart)
          (message "Using %s" pyvenv-virtual-env)))))
(make-alias 'activate-venv)
#+END_SRC

This function installs python dependencies to the current virtualenv
from within Emacs.

#+BEGIN_SRC elisp
(defun elpy-install-requirements ()
  "Install `elpy' and `jedi' to the current virtualenv. The
version of the `elpy' python package is forced to match the
version of the elisp package, upgrading or downgrading as
necessary."
  (interactive)
  (unless pyvenv-virtual-env
    (error "Error: no virtualenv is active"))
  (let ((dest "*elpy-install-requirements-output*")
        (install-cmd (format "%s/bin/pip install --force '%%s'" pyvenv-virtual-env))
        ;; (deps `(,(format "elpy==%s" elpy-version) "jedi")))
        (deps '("jedi" "pyflakes" "pep8" "flake8")))
    (generate-new-buffer dest)
    (mapcar
     #'(lambda (pkg)
         (message (format install-cmd pkg))
         (call-process-shell-command (format install-cmd pkg) nil dest)) deps)
    (call-process-shell-command
     (format "%s/bin/pip freeze" pyvenv-virtual-env) nil dest)
    (switch-to-buffer dest)
    ))
(make-alias 'elpy-install-requirements)
#+END_SRC

I use =C-= + arrows to move between windows, and =M= + arrows to move
by word. These are in muscle memory at this point, and elpy can't have
them.

#+BEGIN_SRC elisp
(add-hook 'elpy-mode-hook
'(lambda ()
   (define-key elpy-mode-map (kbd "C-<right>") nil)
   (define-key elpy-mode-map (kbd "C-<left>") nil)
   (define-key elpy-mode-map (kbd "M-<right>") nil)
   (define-key elpy-mode-map (kbd "M-<left>") nil)
   (define-key elpy-mode-map (kbd "M-<right>") nil)
   (define-key elpy-mode-map (kbd "M-C-]") 'elpy-nav-move-iblock-right)
   (define-key elpy-mode-map (kbd "M-C-[") 'elpy-nav-move-iblock-left)
   (setq elpy-rpc-backend "jedi")
   (add-to-list 'elpy-project-ignored-directories "src")
   (add-to-list 'elpy-project-ignored-directories "*-env")
))
#+END_SRC


** autopep8

Apply =autopep8= (https://github.com/hhatto/autopep8) to the current
buffer. Reference: *Mastering Emacs*:
http://www.masteringemacs.org/articles/2011/10/19/executing-shell-commands-emacs/

#+BEGIN_SRC elisp
  (defun p8 ()
    "Apply autopep8 to the current region or buffer"
    (interactive)
    (unless (region-active-p)
      (mark-whole-buffer))
    (shell-command-on-region
     (region-beginning) (region-end) ;; beginning and end of region or buffer
     "autopep8 -"                    ;; command and parameters
     (current-buffer)                ;; output buffer
     t                               ;; replace?
     "*autopep8 errors*"             ;; name of the error buffer
     t))                             ;; show error buffer?
#+END_SRC

Instead of simply replacing the current buffer, use ediff to compare
it to the output of autopep8.

#+BEGIN_SRC elisp
  (defun p8-and-ediff ()
    "Compare the current buffer to the output of autopep8 using ediff"
    (interactive)
    (let ((p8-output
           (get-buffer-create (format "* %s autopep8 *" (buffer-name)))))
      (shell-command-on-region
       (point-min) (point-max)    ;; beginning and end of buffer
       "autopep8 -"               ;; command and parameters
       p8-output                  ;; output buffer
       nil                        ;; replace?
       "*autopep8 errors*"        ;; name of the error buffer
       t)                         ;; show error buffer?
      (ediff-buffers (current-buffer) p8-output)
      ))
#+END_SRC

* scons

I should really start using a snippet package, but for now:

#+BEGIN_SRC elisp
(defun scons-insert-command ()
  (interactive)
  (insert "output, = env.Command(
    target=,
    source=,
    action=('')
)"))
(make-alias 'scons-insert-command)
#+END_SRC

* text-mode

#+BEGIN_SRC elisp
(add-hook 'text-mode-hook
	  '(lambda ()
	     ;; (longlines-mode)
	     (flyspell-mode)
	     )
	  )
#+END_SRC

* rst-mode

#+BEGIN_SRC elisp
(add-hook 'rst-mode-hook
	  '(lambda ()
	     (message "Loading rst-mode hooks")
	     (flyspell-mode)
	     (define-key rst-mode-map (kbd "C-c C-a") 'rst-adjust)
	     )
	  )
#+END_SRC

* tramp

- http://www.gnu.org/software/tramp/

#+BEGIN_SRC elisp
(condition-case nil
    (require 'tramp)
  (setq tramp-default-method "scp")
  (error (message "** could not load tramp")))
#+END_SRC

* git/magit

#+BEGIN_SRC elisp
(require 'vc-git)
#+END_SRC

Magit is installed via ELPA.

#+BEGIN_SRC elisp
(global-set-key (kbd "C-c m") 'magit-status)
#+END_SRC

